{
  "gm2_02": {
    "title": "GM2.02 - Analytische Geometrie",
    "subtitle": "Geraden, Ebenen und räumliche Beziehungen",
    "line_equations": "Geradengleichungen",
    "plane_geometry": "Ebenengeometrie",
    "spatial_relationships": "Räumliche Beziehungen",
    "basic": "BASIS",
    "core": "KERN",
    "advanced": "ERWEITERT",
    "elite": "ELITE",
    "check": "Überprüfen",
    "next": "Weiter",
    "enter_answer": "Geben Sie Ihre Antwort ein",
    "correct": "Richtig! Gut gemacht.",
    "incorrect": "Nicht ganz. Versuchen Sie es erneut.",
    "hint": "Hinweis",
    "scenario_tram": "Basler Tramlinien-Routenplanung",
    "scenario_tram_desc": "Sie arbeiten mit den Basler Verkehrs-Betrieben (BVB) zusammen, um Tramlinienrouten auf einem Stadtplan zu analysieren. Die Karte verwendet ein Koordinatensystem, bei dem jede Einheit 100 Meter darstellt. Die Tramlinie 8 fährt von Kleinhüningen durch das Stadtzentrum zur Neuweilerstrasse, während die Linie 11 Aesch mit St. Louis (Frankreich) verbindet. Ihre Aufgabe ist es, die mathematischen Gleichungen zu bestimmen, die diese Tramrouten darstellen. Die Linie 8 führt durch den Claraplatz bei den Koordinaten (2, 3) und den Barfüsserplatz bei (5, 9). Die Linie 11 führt durch den Bahnhof Basel SBB bei (4, 2) mit einem Richtungsvektor von (3, 1). Die BVB benötigt diese Gleichungen, um optimale Haltestellenstandorte zu berechnen, zu bestimmen, wo neue Linien bestehende Routen kreuzen könnten, Wartungspläne zu planen, die Serviceunterbrechungen minimieren, und Deckungslücken im Netzwerk zu analysieren. Das Verständnis von Geradengleichungen hilft Stadtplanern, datengestützte Entscheidungen über die öffentliche Verkehrsinfrastruktur zu treffen und sicherzustellen, dass Basler Einwohner effizienten Zugang zu allen Teilen der Stadt haben.",
    "scenario_bridge": "Rheinbrückenbau",
    "scenario_bridge_desc": "Der Kanton Basel-Stadt plant eine neue Fussgänger- und Fahrradbrücke über den Rhein, um die Verbindung zwischen dem Campus der Universität Basel in Grossbasel und den Wohngebieten in Kleinbasel zu verbessern. Sie sind Teil des Ingenieurteams, das für die Strukturplanung verantwortlich ist. Die Brückenplatte wird als Ebene im 3D-Raum modelliert. Drei wichtige Stützpunkte wurden identifiziert: Punkt A (Grossbasel-Seite): (0, 0, 5) - 5 Meter über dem Wasserspiegel, Punkt B (Flussmitte-Stütze): (50, 0, 8) - 8 Meter über dem Wasserspiegel, Punkt C (Kleinbasel-Seite): (100, 0, 6) - 6 Meter über dem Wasserspiegel. Die Koordinaten verwenden Meter, wobei der Ursprung am Grossbasler Flussufer liegt, die x-Achse entlang der Flussquerungsrichtung, die y-Achse entlang der Flussströmung und die z-Achse die Höhe über dem Wasser darstellt. Ihre Aufgaben umfassen die Bestimmung der Ebenengleichung für die Brückenplatte, die Berechnung des Normalenvektors zur Gewährleistung einer ordnungsgemässen Entwässerung, das Auffinden der Schnittpunkte der Brücke mit den Flussufern und die Überprüfung, dass die Brückendurchfahrtshöhe den Navigationsanforderungen entspricht (mindestens 5 Meter über dem Wasser). Dieses Projekt zeigt, wie analytische Geometrie im Bauingenieurwesen unerlässlich ist und sicherstellt, dass Brücken sicher, funktional und ästhetisch in Basels historische Stadtlandschaft integriert sind.",
    "scenario_airport": "Basel-Mulhouse Flughafen Flugbahnanalyse",
    "scenario_airport_desc": "Der EuroAirport Basel-Mulhouse-Freiburg ist in Europa einzigartig und bedient die Schweiz, Frankreich und Deutschland. Fluglotsen verwenden analytische Geometrie, um Flugbahnen zu verwalten und sicherzustellen, dass Flugzeuge sichere Abstände einhalten und optimale Anflugwege befolgen. Sie arbeiten mit dem Luftverkehrsmanagement-Team des Flughafens zusammen, um Flugbahnen im 3D-Raum zu analysieren. Das Koordinatensystem hat seinen Ursprung am Flughafenkontrollturm, wobei die x-Achse nach Osten (Richtung Deutschland), die y-Achse nach Norden (Richtung Basler Stadtzentrum) und die z-Achse nach oben (Höhe in Metern) zeigt. Zwei Flugzeuge nähern sich dem Flughafen: Flug LX318 von Zürich: Position (5000, 8000, 1200), sinkend entlang des Richtungsvektors (-1, -2, -0.3), und Flug AF1642 von Paris: Position (3000, 6000, 1500), sinkend entlang des Richtungsvektors (1, -1, -0.4). Ihre Verantwortlichkeiten umfassen die Bestimmung, ob die Flugbahnen parallel, sich schneidend oder windschief sind, die Berechnung des Mindestabstands zwischen den beiden Flugzeugen, die Überprüfung, dass beide Flüge die erforderliche vertikale Trennung von 1000 Metern einhalten, das Auffinden des Schnittpunkts mit der Bodenebene (z = 0) für jede Flugbahn und die Sicherstellung, dass Flugbahnen lärmempfindliche Gebiete in Basler Quartieren vermeiden. Diese Analyse ist für die Flugsicherheit von entscheidender Bedeutung und zeigt, wie räumliche Geometrie moderne Flugsicherungssysteme in die Lage versetzt, täglich Hunderte von Flügen zu verwalten und dabei strenge Sicherheitsstandards einzuhalten.",
    "scenario_university": "Universität Basel Campus-Gebäudelayout",
    "scenario_university_desc": "Die Universität Basel plant ein neues Forschungsgebäude für das Departement Mathematik und Informatik. Sie sind Teil des Architekturteams, das analytische Geometrie verwendet, um die Position und Ausrichtung des Gebäudes zu optimieren. Der Campus verwendet ein 3D-Koordinatensystem mit dem Ursprung am historischen Kollegienhaus (Hauptgebäude). Das neue Gebäude muss so positioniert werden, dass es natürliches Licht maximiert, Sichtlinien zu historischen Gebäuden aufrechterhält, die Erreichbarkeit von bestehenden Wegen gewährleistet und Basels strenge Bauhöhenvorschriften einhält. Drei bestehende Gebäude definieren den verfügbaren Raum: Kollegienhaus: Ebenengleichung x + 2y = 100, Biozentrum: Ebenengleichung 2x - y = 50, Pharmazentrum: Ebenengleichung x + y + z = 150. Ihre Aufgaben umfassen die Berechnung von Abständen von vorgeschlagenen Gebäudestandorten zu bestehenden Strukturen, die Bestimmung, ob vorgeschlagene Wände parallel oder senkrecht zu bestehenden Gebäuden sind, das Auffinden von Schnittlinien zwischen Gebäudeebenen für gemeinsame Infrastruktur und die Optimierung der Gebäudegrundfläche, um den nutzbaren Raum zu maximieren und gleichzeitig Einschränkungen zu respektieren. Dieses Projekt veranschaulicht, wie analytische Geometrie das architektonische Design unterstützt und hilft, funktionale, ästhetisch ansprechende Räume zu schaffen, die sich in Basels reiches akademisches Erbe integrieren."
  }
}
