{
  "gm2_02": {
    "title": "GM2.02 - Analytical Geometry",
    "subtitle": "Lines, Planes, and Spatial Relationships",
    "line_equations": "Line Equations",
    "plane_geometry": "Plane Geometry",
    "spatial_relationships": "Spatial Relationships",
    "basic": "BASIC",
    "core": "CORE",
    "advanced": "ADVANCED",
    "elite": "ELITE",
    "check": "Verify",
    "next": "Next",
    "enter_answer": "Enter your answer",
    "correct": "Correct! Well done.",
    "incorrect": "Not quite. Try again.",
    "hint": "Hint",
    "scenario_tram": "Basel Tram Line Route Planning",
    "scenario_tram_desc": "You are working with Basel's public transport authority (BVB) to analyze tram line routes on a city map. The map uses a coordinate system where each unit represents 100 meters. Tram Line 8 runs from Kleinhüningen through the city center to Neuweilerstrasse, while Line 11 connects Aesch to St. Louis (France). Your task is to determine the mathematical equations representing these tram routes. Line 8 passes through Claraplatz at coordinates (2, 3) and Barfüsserplatz at (5, 9). Line 11 passes through Basel SBB station at (4, 2) with a direction vector of (3, 1). The BVB needs these equations to calculate optimal stop locations, determine where new lines might intersect existing routes, plan maintenance schedules that minimize service disruptions, and analyze coverage gaps in the network. Understanding line equations helps urban planners make data-driven decisions about public transport infrastructure, ensuring Basel residents have efficient access to all parts of the city.",
    "scenario_bridge": "Rhine River Bridge Construction",
    "scenario_bridge_desc": "The Canton of Basel-Stadt is planning a new pedestrian and bicycle bridge across the Rhine River to improve connectivity between the University Basel campus in Grossbasel and the residential areas in Kleinbasel. You are part of the engineering team responsible for the structural design. The bridge deck will be modeled as a plane in 3D space. Three key support points have been identified: Point A (Grossbasel side): (0, 0, 5) - 5 meters above water level, Point B (Mid-river support): (50, 0, 8) - 8 meters above water level, Point C (Kleinbasel side): (100, 0, 6) - 6 meters above water level. The coordinates use meters, with the origin at the Grossbasel riverbank, x-axis along the river crossing direction, y-axis along the river flow, and z-axis representing height above water. Your tasks include determining the plane equation for the bridge deck, calculating the normal vector to ensure proper drainage, finding where the bridge intersects with the riverbanks, and verifying that the bridge clearance meets navigation requirements (minimum 5 meters above water). This project demonstrates how analytical geometry is essential in civil engineering, ensuring bridges are safe, functional, and aesthetically integrated into Basel's historic cityscape.",
    "scenario_airport": "Basel-Mulhouse Airport Flight Path Analysis",
    "scenario_airport_desc": "EuroAirport Basel-Mulhouse-Freiburg is unique in Europe, serving Switzerland, France, and Germany. Air traffic controllers use analytical geometry to manage flight paths, ensuring aircraft maintain safe distances and follow optimal approach routes. You are working with the airport's air traffic management team to analyze flight paths in 3D space. The coordinate system has its origin at the airport control tower, with x-axis pointing east (toward Germany), y-axis pointing north (toward Basel city center), and z-axis pointing upward (altitude in meters). Two aircraft are approaching the airport: Flight LX318 from Zurich: position (5000, 8000, 1200), descending along direction vector (-1, -2, -0.3), and Flight AF1642 from Paris: position (3000, 6000, 1500), descending along direction vector (1, -1, -0.4). Your responsibilities include determining if the flight paths are parallel, intersecting, or skew, calculating the minimum distance between the two aircraft, verifying that both flights maintain the required 1000-meter vertical separation, finding the intersection point with the ground plane (z = 0) for each flight path, and ensuring flight paths avoid noise-sensitive areas in Basel neighborhoods. This analysis is critical for aviation safety and demonstrates how spatial geometry enables modern air traffic control systems to manage hundreds of flights daily while maintaining strict safety standards.",
    "scenario_university": "University Basel Campus Building Layout",
    "scenario_university_desc": "The University of Basel is planning a new research building for the Department of Mathematics and Computer Science. You are part of the architectural team using analytical geometry to optimize the building's position and orientation. The campus uses a 3D coordinate system with the origin at the historic Kollegienhaus (main building). The new building must be positioned to maximize natural light, maintain sight lines to historic buildings, ensure accessibility from existing pathways, and comply with Basel's strict building height regulations. Three existing buildings define the available space: Kollegienhaus: plane equation x + 2y = 100, Biozentrum: plane equation 2x - y = 50, Pharmazentrum: plane equation x + y + z = 150. Your tasks include calculating distances from proposed building locations to existing structures, determining if proposed walls are parallel or perpendicular to existing buildings, finding intersection lines between building planes for shared infrastructure, and optimizing the building footprint to maximize usable space while respecting constraints. This project illustrates how analytical geometry supports architectural design, helping create functional, aesthetically pleasing spaces that integrate with Basel's rich academic heritage."
  }
}
